# AUR (Arch User Repository) package list
# These packages are only available on Arch Linux through AUR
# Comments start with #

# --- AUR Helpers ---
yay
paru

# --- Development Tools ---
visual-studio-code-bin
github-desktop
aurutils

# --- Applications ---
bibata-cursor-theme
gapless
hardcode-fixer-git
wlogout
auto-cpufreq
hyprpicker
grimblast-git
arch-update
python-pywal16
smile
clipse
swayosd-git
waypaper
ttf-meslo-nerd-font-powerlevel10k
python-haishoku
dopamine-appimage-preview
python-screeninfo
python-imageio
ulauncher-git
matugen-bin
python-materialyoucolor
xwaylandvideobridge
pinta

# --- System Utilities ---
optimus-manager|nvidia
optimus-manager-qt|nvidia
asusctl|asus
supergfxctl|asus
rog-control-center|asus
lact|amd

# --- Fonts ---
ttf-jetbrains-mono
ttf-fira-code
nerd-fonts-complete

# --- Themes and Customization ---
catppuccin-gtk-theme-mocha
papirus-icon-theme
bibata-cursor-theme

# --- Gaming ---
steam|gaming
lutris|gaming
heroic-games-launcher-bin|gaming
vkbasalt|gaming
lib32-vkbasalt|gaming
proton-ge-custom|gaming
dxvk-bin|gaming
vesktop|gaming
protontricks|gaming
goverlay|gaming

# --- Multimedia ---
obs-studio-git
davinci-resolve

# --- Productivity ---
notion-app
obsidian
todoist-nativefier

# --- Laptop Specific ---
batsignal|laptop