# Minimal AUR package list for post-installation Hyprland setup
# Comments start with #

# --- AUR Helpers (if not already installed) ---
yay
paru

# --- Development Tools ---
visual-studio-code-bin
neovim-git

# --- Hyprland Extras ---
waybar-git
wofi-git
swaync-git
hyprpicker-git
grimblast-git
wlogout
swayosd-git
waypaper

# --- System Utilities ---
auto-cpufreq

# --- Fonts ---
ttf-jetbrains-mono-nerd
ttf-firacode-nerd
ttf-meslo-nerd-font-powerlevel10k

# --- Themes and Customization ---
catppuccin-gtk-theme-mocha
bibata-cursor-theme

# --- Applications ---
brave-bin
discord-canary
spotify
obsidian-bin

# --- Productivity ---
ulauncher
rofi-git